*---------------------------------------------------------------------*
* Z390_DSWAP - Self-contained z390 test for DSWAP scalar path.       *
* Two CSECTs, OS linkage. All FP constants BFP hex.                   *
*---------------------------------------------------------------------*
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R4       EQU   4
R5       EQU   5
R6       EQU   6
R7       EQU   7
R8       EQU   8
R9       EQU   9
R10      EQU   10
R11      EQU   11
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
*
TSTDSWAP CSECT
         STM   R14,R12,12(R13)
         LR    R12,R15
         USING TSTDSWAP,R12
         LA    R10,TSAVE
         ST    R13,4(,R10)
         ST    R10,8(,R13)
         LR    R13,R10
*
         WTO   'ZBLAS DSWAP z390 test'
*
* ---- TEST 1: X=[1,2] Y=[3,4] -> X=[3,4] Y=[1,2] ----
*
         WTO   'T1: swap [1,2] [3,4]'
         MVC   T1X(16),T1XINI
         MVC   T1Y(16),T1YINI
         LA    R1,T1PL
         L     R15,=A(DSWAP)
         BALR  R14,R15
* Check X(1)=3
         LD    0,T1X
         CDB   0,BFP3
         BE    T1P1
         WTO   'FAIL X1!=3'
         B     T1C2
T1P1     WTO   'PASS X1=3'
T1C2     DS    0H
* Check X(2)=4
         LD    0,T1X+8
         CDB   0,BFP4
         BE    T1P2
         WTO   'FAIL X2!=4'
         B     T1C3
T1P2     WTO   'PASS X2=4'
T1C3     DS    0H
* Check Y(1)=1
         LD    0,T1Y
         CDB   0,BFP1
         BE    T1P3
         WTO   'FAIL Y1!=1'
         B     T1C4
T1P3     WTO   'PASS Y1=1'
T1C4     DS    0H
* Check Y(2)=2
         LD    0,T1Y+8
         CDB   0,BFP2
         BE    T1P4
         WTO   'FAIL Y2!=2'
         B     TST2
T1P4     WTO   'PASS Y2=2'
*
* ---- TEST 2: N=0 ----
*
TST2     DS    0H
         WTO   'T2: N=0'
         LA    R1,T2PL
         L     R15,=A(DSWAP)
         BALR  R14,R15
         WTO   'PASS N=0'
*
         WTO   'DSWAP: ALL TESTS DONE'
         L     R13,4(,R13)
         LM    R14,R12,12(R13)
         SR    R15,R15
         BR    R14
*
* ---- Test data ----
*
TSAVE    DS    18F
         DS    0D
BFP1     DC    X'3FF0000000000000'         1.0
BFP2     DC    X'4000000000000000'         2.0
BFP3     DC    X'4008000000000000'         3.0
BFP4     DC    X'4010000000000000'         4.0
*
* Test 1: X=[1,2] Y=[3,4]
T1N      DC    F'2'
         DS    0D
T1X      DC    X'3FF0000000000000'         1.0
         DC    X'4000000000000000'         2.0
T1IX     DC    F'1'
         DS    0D
T1Y      DC    X'4008000000000000'         3.0
         DC    X'4010000000000000'         4.0
T1IY     DC    F'1'
T1XINI   DC    X'3FF0000000000000'         1.0
         DC    X'4000000000000000'         2.0
T1YINI   DC    X'4008000000000000'         3.0
         DC    X'4010000000000000'         4.0
T1PL     DC    A(T1N,T1X,T1IX,T1Y)
         DC    X'80',AL3(T1IY)
*
* Test 2: N=0
         DS    0D
T2N      DC    F'0'
         DS    0D
T2X      DC    X'3FF0000000000000'
T2IX     DC    F'1'
         DS    0D
T2Y      DC    X'4008000000000000'
T2IY     DC    F'1'
T2PL     DC    A(T2N,T2X,T2IX,T2Y)
         DC    X'80',AL3(T2IY)
         LTORG
         DROP  R12
*
DSWAP    CSECT
         STM   R14,R12,12(R13)
         LR    R12,R15
         USING DSWAP,R12
         LR    R11,R1
         L     R2,0(,R11)
         L     R2,0(,R2)                   N
         LTR   R2,R2
         BNP   DSW@RT
         L     R4,4(,R11)                  DX
         L     R5,8(,R11)
         L     R5,0(,R5)                   INCX
         L     R6,12(,R11)                 DY
         L     R7,16(,R11)
         L     R7,0(,R7)                   INCY
         SLA   R5,3
         SLA   R7,3
         LTR   R5,R5
         BNM   DSW@AY
         LR    R0,R2
         BCTR  R0,0
         MSR   R0,R5
         LCR   R0,R0
         AR    R4,R0
DSW@AY   DS    0H
         LTR   R7,R7
         BNM   DSW@SL
         LR    R0,R2
         BCTR  R0,0
         MSR   R0,R7
         LCR   R0,R0
         AR    R6,R0
DSW@SL   DS    0H
         LR    R8,R2
DSW@S1   DS    0H
         LD    0,0(,R4)
         LD    2,0(,R6)
         STD   2,0(,R4)
         STD   0,0(,R6)
         AR    R4,R5
         AR    R6,R7
         BCT   R8,DSW@S1
DSW@RT   DS    0H
         LM    R14,R12,12(R13)
         BR    R14
         LTORG
         END   TSTDSWAP
